//********************************************************
// 
// モーションの更新コンポーネント
// Author Tetsuji Yamamoto
// 
//********************************************************
#include "compUpdateMotion.h"
#include "compMotionSkin.h"
#include "object.h"

//**********************************************
// コンストラクタ
//**********************************************
CUpdateMotion::CUpdateMotion()
{
}

//**********************************************
// デストラクタ
//**********************************************
CUpdateMotion::~CUpdateMotion()
{
}

//**********************************************
// 初期化
//**********************************************
void CUpdateMotion::Init(void)
{

}

//**********************************************
// 終了
//**********************************************
void CUpdateMotion::Uninit(void)
{
	// 自身の破棄
	delete this;
}

//**********************************************
// 更新
//**********************************************
void CUpdateMotion::Update(void)
{
	// オーナー取得
	CObject* pOwner = GetOwner();

	// モーション情報取得
	CMotionSkin *pMotionSkin = pOwner->GetComponent<CMotionSkin>();
	if (pMotionSkin == nullptr)return;

	// モーションの更新
	pMotionSkin->UpdateMotion();
}

//**********************************************
// 描画
//**********************************************
void CUpdateMotion::Draw(void)
{
}