//********************************************************
// 
// タイマーコンポーネントクラス
// Author Tetsuji Yamamoto
// 
//********************************************************
#include "CompCounter.h"
#include "myMath.h"

//********************************************************
// コンストラクタ
//********************************************************
CCounter::CCounter(const int nMaxTIme, const bool bMeasure):
m_nMax(nMaxTIme)
{
	m_nTimeCount	= 0;		// 時間カウンター
	m_bMax			= false;	// 最大化否か
	m_bMin			= false;	// 最小化否か
	m_bMeasure		= bMeasure;	// 計測の有無
	m_fPalam		= 0.0f;		// パラメータ
	m_bIncrement	= true;		// インクリメントの有無
}

//********************************************************
// デストラクタ
//********************************************************
CCounter::~CCounter()
{

}

//********************************************************
// 初期化
//********************************************************
void CCounter::Init(void)
{

}

//********************************************************
// 終了
//********************************************************
void CCounter::Uninit(void)
{
	// 自身の削除
	delete this;
}

//********************************************************
// 更新
//********************************************************
void CCounter::Update(void)
{
	// 計測しなければ処理しない
	if(m_bMeasure == false)return;

	// インクリメント状態なら
	if (m_bIncrement == true)
	{
		// 最大までカウントする
		if (Max(m_nTimeCount, m_nMax) == false)
		{
			// カウンターインクリメント
			m_nTimeCount++;

			// 最大フラグを下げる
			m_bMax = false;

			// 最小フラグを下げる
			m_bMin = false;
		}
		else
		{
			// 最大フラグを上げる
			m_bMax = true;
		}
	}
	// デクリメント状態
	else
	{
		// 最大までカウントする
		if (Min(m_nTimeCount, 0) == false)
		{
			// カウンターデクリメント
			m_nTimeCount--;

			// 最小フラグを下げる
			m_bMin = false;

			// 最大フラグを下げる
			m_bMax = false;
		}
		else
		{
			// 最小フラグを上げる
			m_bMin = true;
		}
	}

	// タイマーパラメータ計算
	m_fPalam = my_math::Palam(m_nTimeCount,m_nMax);
}

//********************************************************
// 描画
//********************************************************
void CCounter::Draw(void)
{

}
