//********************************************************
// 
// 船用変数コンポーネントクラス
// Author Tetsuji Yamamoto
// 
//********************************************************
#include "compShipVariable.h"
#include "vector.h"

using namespace my_vector;

//********************************************************
// コンストラクタ
//********************************************************
CShipVariable::CShipVariable()
{
	m_posCenter = InitValu::VEC3_NULL;	//移動中心位置
	m_fAngleMove = 0.0f;				// 移動角度
	m_fAngleMoveDest = 0.0f;			// 目的移動角度
	m_fMovement = 0.0f;					// 移動量
	m_fRadius = 0.0f;					// 半径
	m_fFriction = 0.0f;					// 摩擦係数

}

//********************************************************
// デストラクタ
//********************************************************
CShipVariable::~CShipVariable()
{

}


//********************************************************
// 初期化
//********************************************************
void CShipVariable::Init()
{
}

//********************************************************
// 破棄
//********************************************************
void CShipVariable::Uninit()
{
	delete this;
}

//********************************************************
// 更新
//********************************************************
void CShipVariable::Update()
{
	// 最短の角度差を求める
	float fAngleDiff = AngleShortestDiff(m_fAngleMoveDest, m_fAngleMove);

	// 角度を足す
	m_fAngleMove += fAngleDiff * m_fFriction;
}

//********************************************************
// 描画
//********************************************************
void CShipVariable::Draw()
{

}
